app/Controllers/BookingController.php

    public function index()
    {
        $bookingModel = new BookingModel();
        $bookings = $bookingModel->getBookings();

        $userModel = new UserModel();
        $users = $userModel->findAll();
---
SELECT *
FROM `users`

    public function listRooms()
    {
        $roomModel = new RoomModel;
        $data['rooms'] = $roomModel->findAll();
---
SELECT *
FROM `rooms`

    public function RegistrationForm($id)
    {
        $roomModel = new RoomModel();
        $data['room'] = $roomModel->find($id);
---
SELECT *
FROM `rooms`
WHERE `rooms`.`id` = '10'

            'no_wa' => $no_wa
        ];

        $bookingModel->insert($data);
---
INSERT INTO `booking` (`user_id`, `room_id`, `date_request`, `start_time`, `end_time`, `tujuan`, `status`, `no_wa`) VALUES ('10', '10', '2023-07-14', '7:45 AM', '7:45 AM', 'leffeshfoshf', 'pending', '6281927173726')

    public function updateStatus($id, $newStatus)
    {
        // Memeriksa apakah pengguna sudah login sebagai admin
        if (!session()->has('admin')) {
            return redirect()->to('/'); // Ganti '/' dengan URL halaman login yang sesuai
        }

        // Memperbarui status peminjaman
        $bookingModel = new BookingModel();
        $booking = $bookingModel->find($id);

        if (!$booking) {
            return redirect()->back()->with('error', 'Data peminjaman tidak ditemukan.');
        }

        $booking['status'] = $newStatus;
        $bookingModel->update($id, $booking);
---
SELECT *
FROM `booking`
WHERE `booking`.`id` = '6'
UPDATE `booking` SET `user_id` = '10', `room_id` = '10', `date_request` = '2023-07-14', `start_time` = '07:45:00', `end_time` = '07:45:00', `tujuan` = 'leffeshfoshf', `status` = 'approved', `no_wa` = '6281927173726'
WHERE `booking`.`id` IN ('6')