app/Models/BookingModel.php

SELECT `booking`.*, `rooms`.`ruangan`
FROM `booking`
LEFT JOIN `rooms` ON `rooms`.`id` = `booking`.`room_id`
---
    public function getBookings()
    {
        $db = db_connect();

        $query = $db->table($this->table)
            ->select($this->table . '.*, rooms.ruangan')
            ->join('rooms', 'rooms.id = ' . $this->table . '.room_id', 'left')
            ->get();