app/Models/RoomModel.php

    public function getRooms()
    {
        return $this->findAll();
---
SELECT *
FROM `rooms`